IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM20_CONTROLSS_G0_EPWM20.xml
	<register id="CONTROLSS_G0_EPWM20_XREGSHDW2STS" acronym="CONTROLSS_G0_EPWM20_XREGSHDW2STS" offset="0x428" width="32" description="Shadow Buffer 2 Update Status Register">
		<bitfield id="XMIN_SHDW2FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW2FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW2FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW2FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW2FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW2FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW2FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW2FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW2FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW2FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW2FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW2FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW2FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW2FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW2FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G0_EPWM20_XREGSHDW3STS" acronym="CONTROLSS_G0_EPWM20_XREGSHDW3STS" offset="0x430" width="32" description="Shadow Buffer 3 Update Status Register">
		<bitfield id="XMIN_SHDW3FULL" width="1" begin="14" end="14" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="14" rwaccess="R"/> 
		<bitfield id="XMAX_SHDW3FULL" width="1" begin="13" end="13" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="13" rwaccess="R"/> 
		<bitfield id="XAQCTLB_SHDW3FULL" width="1" begin="12" end="12" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="12" rwaccess="R"/> 
		<bitfield id="XAQCTLA_SHDW3FULL" width="1" begin="11" end="11" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="11" rwaccess="R"/> 
		<bitfield id="CMPD_SHDW3FULL" width="1" begin="10" end="10" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="10" rwaccess="R"/> 
		<bitfield id="CMPC_SHDW3FULL" width="1" begin="9" end="9" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="9" rwaccess="R"/> 
		<bitfield id="XTBPRD_SHDW3FULL" width="1" begin="8" end="8" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="8" rwaccess="R"/> 
		<bitfield id="XCMP8_SHDW3FULL" width="1" begin="7" end="7" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="7" rwaccess="R"/> 
		<bitfield id="XCMP7_SHDW3FULL" width="1" begin="6" end="6" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="6" rwaccess="R"/> 
		<bitfield id="XCMP6_SHDW3FULL" width="1" begin="5" end="5" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="5" rwaccess="R"/> 
		<bitfield id="XCMP5_SHDW3FULL" width="1" begin="4" end="4" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="4" rwaccess="R"/> 
		<bitfield id="XCMP4_SHDW3FULL" width="1" begin="3" end="3" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="3" rwaccess="R"/> 
		<bitfield id="XCMP3_SHDW3FULL" width="1" begin="2" end="2" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="2" rwaccess="R"/> 
		<bitfield id="XCMP2_SHDW3FULL" width="1" begin="1" end="1" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="1" rwaccess="R"/> 
		<bitfield id="XCMP1_SHDW3FULL" width="1" begin="0" end="0" resetval="0x0" description="0 Shadow Register is not full yet 1 Indicates the Shadow Register is full, a CPU write will over-write current Shadow value" range="0" rwaccess="R"/>
	</register>
